01  WS-AREA-1 PIC 9(5) VALUE 0.
01  WS-AREA-2 PIC 9(5) VALUE 0.
01 WS-COUNTER PIC 9(3) VALUE 1000. 

PROCEDURE DIVISION.
    PERFORM UNTIL WS-COUNTER = 0 
        ADD 1 TO WS-AREA-1.
        IF WS-AREA-1 > 100
            MOVE 0 TO WS-AREA-1
        END-IF
        ADD 1 TO WS-AREA-2.
        IF WS-AREA-2 > 50
            MOVE 0 TO WS-AREA-2
        END-IF
        DISPLAY WS-AREA-1 WS-AREA-2
        SUBTRACT 1 FROM WS-COUNTER
    END-PERFORM.
    STOP RUN.
END PROGRAM.